stubs/__files/partner/dgf/OALBereitstellung-QEB.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ns2="http://spri.telekom.de/oss/v5/envelopeOal">
    <soapenv:Header/>
    <soapenv:Body>
        <ns2:annehmenMeldungRequest xmlns:ns2="http://spri.telekom.de/oss/v5/envelopeOal"
                                    xmlns:ns4="http://spri.telekom.de/oss/v5/message">
            <control>
                <zeitstempel>{{now format='yyyy-MM-dd'}}T{{now format='HH:mm:ss.SSS'}}</zeitstempel>
                <majorRelease>04</majorRelease>
                <minorRelease>90</minorRelease>
                <signaturId>
                    <issuer>DTAG</issuer>
                    <serial>123456</serial>
                </signaturId>
            </control>
            <meldung>
                <auftragstyp>
                    <geschaeftsfall>NEU</geschaeftsfall>
                    <aenderungsKennzeichen>Standard</aenderungsKennzeichen>
                    <geschaeftsfallart>Bereitstellung</geschaeftsfallart>
                </auftragstyp>
                <meldungstyp xsi:type="ns4:MeldungstypQEBType" xmlns:ns4="http://spri.telekom.de/oss/v5/message"
                             xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                    <meldungsattribute>
                        <externeAuftragsnummer>{{soapXPath request.body '/annehmenAuftragRequest/auftrag/externeAuftragsnummer/text()'}}</externeAuftragsnummer>
                        <auftraggebernummer>2020005101</auftraggebernummer>
                    </meldungsattribute>
                    <meldungspositionen>
                        <position>
                            <meldungscode>0000</meldungscode>
                            <meldungstext>Keine Änderung zum Auftrag.</meldungstext>
                            <positionsattribute xsi:type="ns4:MeldungspositionsattributeQEBType">
                                <ansprechpartnerLeistungserbringer>
                                    <anrede>1</anrede>
                                    <vorname>Hans</vorname>
                                    <nachname>Beispiel</nachname>
                                    <telefonnummer>02314564654</telefonnummer>
                                    <faxnummer>02314564654</faxnummer>
                                    <emailadresse>invalid@vitroconnect.de</emailadresse>
                                </ansprechpartnerLeistungserbringer>
                            </positionsattribute>
                        </position>
                    </meldungspositionen>
                </meldungstyp>
            </meldung>
        </ns2:annehmenMeldungRequest>
    </soapenv:Body>
</soapenv:Envelope>
